{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "0b0a290e-1f42-412d-b0c2-49d98cf4812d",
   "metadata": {},
   "source": [
    "1. Дан словарь различных слов и доска размером M x L, где в каждой ячейке есть один символ. Найдите все возможные слова из словаря, которые могут быть образованы последовательностью соседних символов на доске. Разрешено перемещение к любой из 8 соседних ячеек.\n",
    "\n",
    "    Примечание:\n",
    "\n",
    "    При формировании слова мы можем переместиться в любую из 8 соседних ячеек. Ячейка может быть использована только один раз в одном слове.\n",
    "\n",
    "    Формат входных данных\n",
    "\n",
    "    На вход программе в первой строке подаётся число слов в словаре N. В словаре минимум одно слово. В следующей строке передаётся словарь. В последующей строке два числа M и L - размер доски M x L и далее расположение букв на доске в виде {{буквы 1-й строки},{ буквы 2-й строки },{и т. д.}}.\n",
    "\n",
    "    Формат выходных данных\n",
    "\n",
    "    Вывести слова, которые можно образовать в отсортированном порядке в одной строке через пробел.\n",
    "\n",
    "    Примеры\n",
    "\n",
    "    Ввод:\n",
    "\n",
    "    4 \\\n",
    "    GEEKS FOR QUIZ GO \\\n",
    "    3 3 \\\n",
    "    G I Z \\\n",
    "    U E K \\\n",
    "    Q S E\n",
    "\n",
    "    Вывод:\n",
    "\n",
    "    GEEKS QUIZ"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d74c6c5d-944a-46be-9ce6-176850bb10e3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 4\n",
      " GEEKS FOR QUIZ GO\n",
      " 3 3\n",
      " G I Z\n",
      " U E K\n",
      " Q S E\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "GEEKS QUIZ\n"
     ]
    }
   ],
   "source": [
    "def find_words(d, board):\n",
    "\n",
    "    m = len(board)\n",
    "    l = len(board[0])\n",
    "    found_words = set()\n",
    "\n",
    "    def is_valid(row, col):\n",
    "        return 0 <= row < m and 0 <= col < l\n",
    "\n",
    "    def dfs(h,w, word, path, current_word):\n",
    "\n",
    "        if current_word == word:\n",
    "            found_words.add(word)\n",
    "            return\n",
    "\n",
    "        if len(current_word) > len(word):\n",
    "            return\n",
    "\n",
    "        directions = [\n",
    "            (0, 1),\n",
    "            (0, -1),\n",
    "            (1, 0),\n",
    "            (-1, 0),\n",
    "            (1, 1),\n",
    "            (1, -1),\n",
    "            (-1, 1),\n",
    "            (-1, -1),\n",
    "        ]\n",
    "\n",
    "        for dr, dc in directions:\n",
    "            new_h = h + dr\n",
    "            new_w = w + dc\n",
    "\n",
    "            if is_valid(new_h, new_w) and (new_h, new_w) not in path and word.startswith(current_word + board[new_h][new_w]):\n",
    "                dfs(new_h, new_w, word, path + [(new_h, new_w)], current_word + board[new_h][new_w],)\n",
    "\n",
    "    for word in d:\n",
    "        for h in range(m):\n",
    "            for w in range(l):\n",
    "                if board[h][w] == word[0]:\n",
    "                    dfs(h, w, word, [(h, w)], board[h][w])\n",
    "\n",
    "    return sorted(list(found_words))\n",
    "\n",
    "n = int(input())\n",
    "dictionary = input().split()\n",
    "m, l = map(int, input().split())\n",
    "\n",
    "board = []\n",
    "for _ in range(m):\n",
    "    board.append(input().split())\n",
    "\n",
    "result = find_words(dictionary, board)\n",
    "print(\" \".join(result))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5776a715-9062-4228-b483-c74a5468e162",
   "metadata": {},
   "source": [
    "4. Правитель Графландии решил провести реформу административных округов в своём государстве. Новые окружные центры правитель выбрал, вам остаётся всего лишь распределить остальные города по округам.\n",
    "\n",
    "    При этом правителю хочется, чтобы расстояние от города до окружного центра этого города не превышало расстояний от данного города до других окружных центров. Требуется вывести минимальную сумму расстояний от города до его окружного центра.\n",
    "\n",
    "    Формат входных данных\n",
    "\n",
    "    На вход программе в первой строке подаётся несколько (не менее трёх) чисел через пробел: N M CA CB ... , где\n",
    "\n",
    "     - 2 ≤ N ≤ 1000 - число городов в государстве;\n",
    "\n",
    "     - 1 ≤ M ≤ 100000 - число дорог между городами;\n",
    "\n",
    "     - Ci - номера городов, которые правитель выбрал окружными центрами.\n",
    "\n",
    "    В следующих M строках задаются дороги, по три числа в каждой строке - номера соединенных городов и длина дороги.\n",
    "\n",
    "    Города нумеруются с нуля.\n",
    "\n",
    "    Формат выходных данных\n",
    "\n",
    "    Вывести минимальную сумму расстояний от города до его окружного центра. Если для города не достижим ни один из окружных центров, то этот город в расчёте расстояний не учитывается.\n",
    "\n",
    "    Примеры\n",
    "\n",
    "    Ввод:\n",
    "\n",
    "    4 3 0 1 \\\n",
    "    0 1 34 \\\n",
    "    2 1 7 \\\n",
    "    3 2 85\n",
    "\n",
    "    Вывод:\n",
    "\n",
    "    99"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "52b33439-5c19-4144-91a2-ffe6797f81f0",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 4 3 0 1\n",
      " 0 1 34\n",
      " 2 1 7\n",
      " 3 2 85\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "99\n"
     ]
    }
   ],
   "source": [
    "import heapq\n",
    "\n",
    "def solve():\n",
    "    line = list(map(int, input().split()))\n",
    "    n = line[0]\n",
    "    m = line[1]\n",
    "    centers = line[2:]\n",
    "\n",
    "    graph = [[] for _ in range(n)]\n",
    "    for _ in range(m):\n",
    "        u, v, w = map(int, input().split())\n",
    "        graph[u].append((v, w))\n",
    "        graph[v].append((u, w))\n",
    "\n",
    "    t_d = 0\n",
    "    for city in range(n):\n",
    "        min_distance = float('inf')\n",
    "        \n",
    "        for center in centers:\n",
    "          dist = dijkstra(graph, city, center)\n",
    "          if dist != float('inf'):\n",
    "             min_distance = min(min_distance,dist)\n",
    "\n",
    "        if min_distance != float('inf'):\n",
    "           t_d += min_distance\n",
    "\n",
    "    print(t_d)\n",
    "\n",
    "\n",
    "def dijkstra(graph, start, end):\n",
    "\n",
    "    distan = {node: float('inf') for node in range(len(graph))}\n",
    "    distan[start] = 0\n",
    "    pq = [(0, start)]\n",
    "\n",
    "    while pq:\n",
    "        dist, u = heapq.heappop(pq)\n",
    "\n",
    "        if dist > distan[u]:\n",
    "            continue\n",
    "\n",
    "        if u == end:\n",
    "            return dist\n",
    "\n",
    "        for v, weight in graph[u]:\n",
    "            if distan[v] > distan[u] + weight:\n",
    "                distan[v] = distan[u] + weight\n",
    "                heapq.heappush(pq, (distan[v], v))\n",
    "\n",
    "    return float('inf')\n",
    "solve()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bcd899ab-307e-4c3c-aa99-81ec3efe39e9",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
