{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "4b433221-7ff1-400d-a5b5-bd49f55095d2",
   "metadata": {},
   "source": [
    "Федя Лягушонков сидит на камне посреди озера. Внезапно он замечает Фаню Лягушонкову, которая сидит на другом камне. Федя хочет добраться до Фани, но так как вода грязная, он\n",
    "хочет избежать попадания в воду и добраться до нее, прыгая по камушкам.\n",
    "Чтобы выполнить заданную последовательность прыжков, длина одного прыжка лягушки, очевидно, должна не меньше длины самого длинного прыжка в последовательности.\n",
    "Лягушачье расстояние (frog distance, или минимаксное расстояние) между двумя камнями определяется как\n",
    "минимальная длина прыжка среди всех возможных путей (последовательностей прыжков) между двумя камнями.\n",
    "На вход даются координаты камня Феди, камня Фани и всех других камней в озере. \n",
    "Вычислите минимаксное расстояние между камнями Феди и Фани.\n",
    "\n",
    "Формат ввода:\n",
    "* в первой строке указано N - количество камней в озере\n",
    "* далее идут N строк с координатами камней. Первый камень в списке - камень Феди, второй - камень Фани.\n",
    "\n",
    "Формат вывода:\n",
    "* вещественное число с точностью до 3 цифр после запятой, равное минимаксному расстоянию между камнями Феди и Фани.\n",
    "Пример\n",
    "ввод:\n",
    "\n",
    "3\n",
    "\n",
    "17 4\n",
    "  \n",
    "19 4\n",
    "\n",
    "18 5\n",
    "\n",
    "вывод:\n",
    "1.414"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "312a684e-61f9-4d8b-b8a3-47fc8f769df2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 3\n",
      " 17 4\n",
      " 19 4\n",
      " 18 5\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1.414\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "\n",
    "count = int(input())\n",
    "mas = []\n",
    "for i in range(count):\n",
    "    mas.append(list(map(int, input().split())))\n",
    "min = sys.maxsize\n",
    "\n",
    "for i in mas:\n",
    "    for j in mas:\n",
    "        dist = ((i[0] - j[0])**2 + (i[1] - j[1])**2)**0.5\n",
    "        if dist < min and dist != 0:\n",
    "            min = dist\n",
    "\n",
    "print(round(min, 3))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2925a1c2-9c89-47c0-b7eb-6bbe6bc8b2fd",
   "metadata": {},
   "source": [
    "Ответы на вопросы по статье\n",
    "\n",
    "0. Да\n",
    "1. Статья посвящена модифицированному алгоритму Флойда-Уоршелла для случая разреженных и больших графов.\n",
    "2.  Его преимущество заключается в уменьшенном количестве операций релаксации для разреженных графов. Автор предлагает новый метод для повышения эффективности алгоритма Флойда-Уоршелла. Стандартный алгоритм Флойда-Уоршелла, хотя и прост в реализации, выполняет много ненужных операций. \n",
    "\n",
    "> \"Since, the condition of the if statement will not be\n",
    " satisﬁed when either 𝐴[𝑖, 𝑘] or 𝐴[𝑘, 𝑗] is ∞, most of these\n",
    " explorations will be a useless.\"\n",
    "\n",
    "3. Активно пользовался переводчиком :)\n",
    "4. Опечаток обнаружено не было\n",
    "5. В целом, информации достаточно для реализации улучшенного алгоритма Флойда-Уоршелла.\n",
    "6. Существуют ли другие варианты улучшения алгоритма Флойда-Уоршелла?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "53a0d012-2b48-41f0-8022-d93f3a0ab44a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
